In [1]:
import pandas as pd

In [2]:
pd.__version__

'0.25.3'

## 列名を指定して追加する方法だと末尾（最後、右端）に追加される

In [3]:
df = pd.DataFrame({
    'name'    : ['Alice', 'Bob', 'Charlie', 'David', 'Eve', 'Fred'],
    'English' : [12, 34, 56, 78, 90, 100],
    'Math'    : [88, 66, 55, 44, 22, 11]    
})

df

      name  English  Math
0    Alice       12    88
1      Bob       34    66
2  Charlie       56    55
3    David       78    44
4      Eve       90    22
5     Fred      100    11

In [4]:
df['new_column'] = 'value'

In [5]:
df

      name  English  Math new_column
0    Alice       12    88      value
1      Bob       34    66      value
2  Charlie       56    55      value
3    David       78    44      value
4      Eve       90    22      value
5     Fred      100    11      value

In [6]:
df['new_column_2'] = ['a', 'b', 'c', 'd', 'e', 'f']

In [7]:
df

      name  English  Math new_column new_column_2
0    Alice       12    88      value            a
1      Bob       34    66      value            b
2  Charlie       56    55      value            c
3    David       78    44      value            d
4      Eve       90    22      value            e
5     Fred      100    11      value            f

## 先頭（最初、左端）に追加するにはinsertを使う

In [8]:
df = pd.DataFrame({
    'name'    : ['Alice', 'Bob', 'Charlie', 'David', 'Eve', 'Fred'],
    'English' : [12, 34, 56, 78, 90, 100],
    'Math'    : [88, 66, 55, 44, 22, 11]    
})

In [9]:
df.insert(0, 'new_column', 'value')
df

  new_column     name  English  Math
0      value    Alice       12    88
1      value      Bob       34    66
2      value  Charlie       56    55
3      value    David       78    44
4      value      Eve       90    22
5      value     Fred      100    11

In [10]:
df.insert(0, 'new_column_2', ['a', 'b', 'c', 'd', 'e', 'f'])
df

  new_column_2 new_column     name  English  Math
0            a      value    Alice       12    88
1            b      value      Bob       34    66
2            c      value  Charlie       56    55
3            d      value    David       78    44
4            e      value      Eve       90    22
5            f      value     Fred      100    11

In [11]:
df.insert(0, 'new_column_error', ['a', 'b', 'c', 'd', 'e'])  # 6行ぶんを書くべきところ、要素数5の配列を入れた

ValueError: Length of values does not match length of index

In [12]:
df.insert(0, 'new_column', 'another_value')
df

ValueError: cannot insert new_column, already exists